{
  "uk": {
    "lang": "uk",
    "name": "Олег Кухаришин",
    "home": "Головна",
    "about": "Про мене",
    "portfolio": "Портфоліо",
    "contacts": "Контакти",
    "callMe": "Напишіть мені",
    "city": "Кам'янець-Подільський",
    "goToGallery": "Переглянути галерею",
    "mainTitle": "Мене звати",
    "shortBio": "Привіт! Я захоплений веб-розробник, який завжди прагне створювати яскраві, стильні та функціональні вебсайти. Моя мета – поєднати креативність і технічні навички, щоб допомогти кожному проєкту втілити унікальне бачення. Я вірю, що добре спроєктований сайт – це не лише естетика, але й потужний інструмент для досягнення цілей. Запрошую вас ознайомитися з моїм портфоліо, щоб побачити результати моєї роботи в дії. З кожним новим проєктом я вдосконалюю свої навички, використовуючи сучасні технології для створення вебсайтів, які захоплюють увагу та працюють ефективно.",
    "bio": "Мене звати Олег, і пару років тому мене зацікавила ІТ-сфера, а саме її активний розвиток в Україні та можливості навчатися і вдосконалюватися у своїй справі безкінечно. Я хотів змінити роботу й ІТ-спеціальність давала найбільші перспективи стати професіоналом, якщо докладу зусиль. Мені подобається розбиратися у спеціальності повністю, тому я закінчив курси GoIT за програмою Full Stack Developer. Наразі мені краще вдається Frontend, подобається робота над стилізацією інтерфейсів з бібліотекою React, проте я вдосконалююся і у Backend-розробці. Мені добре вдається ладнати з колегами, які неодноразово відмічали мої організаторські якості (під час навчання в GoIT я часто виконував роль Scrum-майстра ). Також цікавлюся дизайном, тож добре справляюся з усіма труднощами, які виникають при роботі з макетами. В мене немає комерційного досвіду, але в pet-проекти я вкладаю всі свої сили, знання та креатив, доводжу роботу над ними до кінця, щоб вони мали вигляд готового продукту. Кожного дня практикуюся, наповнюю власне портфоліо та відвідую тренінги. Маю готовність навчатися далі, поліпшувати свої навики та своє життя. Хочу навчатися та працювати з найкращими, тому із задоволенням стану частиною вашої команди і покажу чого вартий, допоможу разом досягати більшого, якщо ви дасте мені шанс.",
    "bio2": "Наразі мені краще вдається Frontend, подобається робота над стилізацією інтерфейсів з бібліотекою React, проте я вдосконалююся і у Backend-розробці. Мені добре вдається ладнати з колегами, які неодноразово відмічали мої організаторські якості (під час навчання в GoIT я часто виконував роль Scrum-майстра ). Також цікавлюся дизайном, тож добре справляюся з усіма труднощами, які виникають при роботі з макетами. В мене немає комерційного досвіду, але в pet-проекти я вкладаю всі свої сили, знання та креатив, доводжу роботу над ними до кінця, щоб вони мали вигляд готового продукту. Кожного дня практикуюся, наповнюю власне портфоліо та відвідую тренінги. Маю готовність навчатися далі, поліпшувати свої навики та своє життя.",
    "bio3": "Хочу навчатися та працювати з найкращими, тому із задоволенням стану частиною вашої команди і покажу чого вартий, допоможу разом досягати більшого, якщо ви дасте мені шанс.",
    "secondaryTitle": "Про мене",
    "secondarySubTitle": "всього декілька слів",
    "galleryMainTitle": "Мої останні роботи:",
    "projectDetailsSubtitle": "Структура і функціонал",
    "usingSkills": "Вже користуюсь",
    "learningSkills": "Вивчаю",
    "samplesTitle": "Мої роботи",
    "samplesSubtitle": "Натисніть на конкретну роботу, щоб перейти на сторінку опису, або перейдіть до портфоліо",
    "samplesButton": "Переглянути галерею",
    "more": "Більше...",
    "forward": "Попередній",
    "previous": "Наступний",
    "usedTech": "Використані технології"
  },
  "en": {
    "lang": "en",
    "name": "Oleh Kukharyshyn",
    "home": "Home",
    "about": "About me",
    "portfolio": "Portfolio",
    "contacts": "Contacts",
    "callMe": "Contact me",
    "city": "Kamianets-Podilskyi",
    "goToGallery": "Watch gallery",
    "mainTitle": "My name is",
    "shortBio": "Greetings! I am a passionate web developer who always strives to create bright, stylish and functional websites. My goal is to combine creativity and technical skills to help each project realize a unique vision. I believe that a well-designed website is not only about aesthetics, but also a powerful tool for achieving goals. I invite you to explore my portfolio to see the results of my work in action. With each new project, I improve my skills, using modern technologies to create websites that capture attention and work efficiently.",
    "bio": "My name is Oleg, and a couple of years ago I became interested in the IT field, namely its active development in Ukraine and the endless opportunities to study and improve in my work. I wanted to change my job and the IT specialty offered the greatest prospects for becoming a professional. if I make an effort I like to understand the specialty, so I have completed the GoIT course, I am better at Frontend, but I am getting better at Backend development with colleagues who have repeatedly noted my organizational qualities (during my studies at GoIT I often played the role of Scrum master), so I cope well with all the difficulties that arise when working with layouts. I have no commercial experience, but in pet-projects I put all my strength, knowledge and creativity, I bring work on them to the end so that they look like a finished product. Every day I practice, fill my own portfolio and attend trainings. I am willing to study further, improve my skills and my life. I want to learn and work with the best, so I will be happy to be part of your team and show what I'm worth, help achieve more together, if you give me a chance.",
    "bio2": "Currently, I am better at Frontend, I like working on styling interfaces with the React library, but I am also improving in Backend developers. I manage to get along well with colleagues who repeatedly noted my organizational qualities (during my studies at GoIT I often performed the role of Scrum master). Also interested in design, so good cope with all the difficulties that arise when working with layouts. I have I have no commercial experience, but I put all my strength into pet projects, knowledge and creativity, bring work on them to the end, so that they look finished product. Every day I practice, fill my own portfolio and I attend trainings. I am ready to study further, to improve my skills and his life.",
    "bio3": "I want to study and work with the best, so I'm happy to be here part of your team and I will show you what you are worth, I will help you achieve together more if you give me a chance.",
    "secondaryTitle": "About me",
    "secondarySubTitle": "just a few words",
    "galleryMainTitle": "My latest works:",
    "projectDetailsSubtitle": "Structure and functionality",
    "usingSkills": "Already use it",
    "learningSkills": "I am studying",
    "samplesTitle": "My works",
    "samplesSubtitle": "Click on a specific work to go to the description page or go to the portfolio",
    "samplesButton": "View the gallery",
    "more": "More...",
    "forward": "Forward",
    "previous": "Previous",
    "usedTech": "Used technologies"
  }
}
